Repository: charlie-ogier/BarcodeCreator
Catalog: .lang/*.po
Languages: fr

source: Create 128B barcodes, copy the results to a Word Processor or Spreadsheet to print them out. You can read them with a barcode gun or a smart phone. Includes an extra 'explanation' form and sample spreadsheet. The font required is supplied with the program UPDATED: - Maintenant avec traduction française
fr: Créer des codes-barres 128B, copiez les résultats dans un traitement de texte ou une feuille de calcul pour les imprimer. Vous pourrez les lire avec un pistolet à code-barres ou un smart phone. Inclue un formulaire 'explication' supplémentaire et un exemple de feuille de calcul. La fonte requise est fournie avec le programme actualisé: - Maintenant avec traduction française

source: 01 is the location in the store where the item is stored, 'P1725' is the part number and 'FFF' is a hex number of the quantity.
fr: 01 est l'emplacement dans le magasin où l'article est stocké, «P1725» est le numéro de pièce et «FFF» est un nombre hexadécimal de la quantité.

source: See the spreadsheet by clicking the 'Sheet' button on the main Form.
fr: Voir la feuille de calcul en cliquant sur le bouton 'Feuille' du formulaire principal.

source: So using a Calc formula ' = Mid(B8, 3, 2) & ' - ' & Mid(B8, 5, 5) & ' - Qty ' & HEX2DEC(Mid(A4, Len(B8) - 4, 3))' the following result can be created.
fr: Donc, en utilisant la formule ' = Mid(B8, 3, 2) & ' - ' & Mid(B8, 5, 5) & ' - Qté ' & HEX2DEC(Mid(A4, Len(B8) - 4, 3))' le résultat suivant sera créé.

source: The actual barcode will have 'Start', 'End' and 'Check symbol' characters so will be written as 'ÌK01P1725FFF3Î' but read as 'K01P1725FFF'.
fr: Le code-barres actuel a les caractères 'Commencer', 'Fin' et 'Vérifier le symbole', ce qui sera écrit 'ÌK01P1725FFF3Î' mais sera lu comme 'K01P1725FFF'.

source: e.g. In LibreOffice Calc once the text is Pasted in a cell change the font to 'code128' increase the font size to about 36,
fr: Par exemple. Dans LibreOffice Calc, une fois que le texte est collé dans une cellule, changez la fonte en 'code128' et augmentez la taille de la fonte à environ 36,

source: resize the cell and centre the contents. You can then print out your code.<p>
fr: redimensionner la cellule et centrer le contenu. Vous pourrez ensuite imprimer votre code.

source: !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~<br>
fr: !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~

source: Example code For your Widget store 'K01P1725FFF'. The K will tell your Gambas program that it should expect a code of 11 characters,
fr: Exemple de code pour magasin de widgets 'K01P1725FFF'. Le K indique à Gambas qu'il doit recevoir un code de 11 caractères,

source: Permitted charaters, including spaces, are: - <br>
fr: Les caractères autorisés, y compris les espaces, sont:

source: The barcode font size will change If the form is resized. <br>
fr: La taille de la fonte du code-barres changera si le formulaire est redimensionné. <br>

source: The barcode text can be copied to the Clipboard and then pasted into a Word Processor or Spreadsheet program as Text.
fr: Le texte du code-barres peut être copié dans le Presse-papiers, puis collé dans un traitement de texte ou un tableur sous forme de texte.

source: This program allows you to create 128B barcodes upto 20 characters, the longer the code the harder it is to read.<br>
fr: Ce programme vous permet de créer du code-barres 128B jusqu'à 20 caractères, plus le code est long, plus il est difficile à lire.<br>

source: With special thanks to Didier Gilles for the French translation
fr: Un merci spécial à Didier Gilles pour la traduction française

source: You need to install the 'code128' font - See below<br>
fr: Vous devez installer la fonte 'code128' - Voir plus bas

source: A copy of the GNU General Public License is available from the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA
fr: Une copie de la licence publique générale GNU est disponible auprès de la Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA

source: Copyright (C) Charlie Ogier 2017 <p>
fr: Droits d'auteur (C) Charlie Ogier 2017 <p>

source: Grand Zebu, the author says 'I will provide you all the software parts...free As Usual!'. Thanks to Grand for this. The font is released under GNU General Public License.<p>
fr: Grand Zebu, l'auteur dit 'je vous fournirai toutes les parties du logiciel ... libres comme d'habitude!'. Merci à lui pour cela. La fonte est publiée sous GNU General Public License.<p>

source: Please send any comments or bugs to bugs@cogier.com<p>
fr: S'il vous plaît envoyer vos commentaires ou bugs à bugs@cogier.com<p>

source: The font is also available from http://grandzebu.net/informatique/codbar-en/codbar.htm (English) and is included in this program's folder.<p>
fr: La fonte est également disponible sur http://grandzebu.net/informatique/codbar-en/codbar.htm (en anglais) et est incluse dans le dossier de ce programme.<p>

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See theGNU General Public License for more details.<p>
fr: Ce programme est distribué dans l'espoir qu'il sera utile, mais SANS AUCUNE GARANTIE; Sans même la garantie implicite de QUALITÉ MARCHANDE ou d'ADÉQUATION À UN USAGE PARTICULIER. Voir la Licence Publique Générale GNU pour plus de détails.<p>

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or ('(at your option)any later version. <p>
fr: Ce programme est un logiciel libre; Vous pouvez le redistribuer et/ou le modifier selon les termes de la GNU General Public License publiée par la Free Software Foundation; Soit la version 2 de la licence, ou (selon votre choix) toute version ultérieure. <p>

source: This program requires that the font 'code128' be installed. Click on the 'Install Barcode Font' tool bar button to install this font.<p>
fr: Ce programme nécessite l'installation de la fonte 'code128'. Cliquer sur le bouton de la barre d'outils 'Install Barcode Font' pour installer cette police.<p>

source: Done
fr: Terminé

source: Check symbol database
fr: Vérifier la base des symboles

source: 128B Start
fr: 128B début

source: Character
fr: Caractère

source: ASCII value =
fr: Valeur ASCII =

source: less 32 =
fr: moins 32 =

source: multiplied by its position (
fr: multiplié par sa position (

source: Or
fr: Ou

source: Check symbol
fr: Vérifier le symbole

source: from the list below =
fr: de la liste ci-dessous =

source: Character
fr: Caractère

source: 128B End
fr: 128B fin

source: Breakdown & selecting the 'Check symbol'
fr: Décomposition et sélection du 'Vérificateur de symbole'

source: Bye!
fr: Au revoir!

source: characters
fr: caractères

source: No characters
fr: Pas de caractère

source: 1 character
fr: 1 caractère

source: Cancel
fr: Annuler

source: Continue
fr: Continuer

source: This will help you install the 'code128' font, the program will close and will need to be restarted after installation
fr: Cela vous aidera à installer la fonte 'code128', le programme va se fermer et devra être redémarré après l'installation

source: Next
fr: Suivant

source: Use the font tools from your ditribution to install the font
fr: Utiliser les outils de fonte de votre distribution pour installer la fonte

source: When you click 'Next' an external program should launch and offer you the opportunity to install the 'code128' font. If you run into difficulties you will find the font in your Home folder
fr: Lorsque vous cliquez sur 'Suivant', un programme externe va se lancer et offrir la possibilité d'installer la police 'code128'. Si vous rencontrez des difficultés, vous trouverez la police dans le dossier Accueil

source: Exit the program
fr: Quitter le programme

source: Help and About
fr: Aide et à propos

source: Install Barcode Font
fr: Installer la police de Barcode

source: Enter the text for your barcode
fr: Entrer le texte à coder

source: Permitted charaters, including spaces, are: - !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNO PQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~
fr: Les caratères autorisés, y compris les espaces, sont: - !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNO PQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~

source: Clear
fr: Nettoyer

source: Copy the barcode text to the clipboard
fr: Copier le texte du code-barres dans le presse-papiers

source: Copy
fr: Copie

source: Open a example barcode spreadsheet
fr: Ouvrir un exemple de feuille de calcul de code-barres

source: Sheet
fr: Tableur

source: Extra details
fr: Détails supplémentaires

source: Breakdown
fr: Détail
